RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer4_cnt.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_timer4_cnt.c
 **
 ** A detailed description is available at
 ** @link Timer4CntGroup Timer4CNT description @endlink
 **
 **   - 2018-11-02 CDT First version for Device Driver Library of Timer4CNT.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_timer4_cnt.h"
#include "hc32f460_utility.h"

#if (DDL_TIMER4_CNT_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup Timer4CntGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter validity check for Timer4 unit  */
#define IS_VALID_TIMER4(__TMRx__)                                              \
(   (M4_TMR41 == (__TMRx__))                ||                                 \
    (M4_TMR42 == (__TMRx__))                ||                                 \
    (M4_TMR43 == (__TMRx__)))

/*!< Parameter validity check for CNT pclk division  */
#define IS_VALID_CNT_CLK_DIV(x)                                                \
(   (Timer4CntPclkDiv1    == (x))           ||                                 \
    (Timer4CntPclkDiv2    == (x))           ||                                 \
    (Timer4CntPclkDiv4    == (x))           ||                                 \
    (Timer4CntPclkDiv8    == (x))           ||                                 \
    (Timer4CntPclkDiv16   == (x))           ||                                 \
    (Timer4CntPclkDiv32   == (x))           ||                                 \
    (Timer4CntPclkDiv64   == (x))           ||                                 \
    (Timer4CntPclkDiv128  == (x))           ||                                 \
    (Timer4CntPclkDiv256  == (x))           ||                                 \
    (Timer4CntPclkDiv512  == (x))           ||                                 \
    (Timer4CntPclkDiv1024 == (x)))

/*!< Parameter validity check for CNT mode  */
#define IS_VALID_CNT_MODE(x)                                                   \
(   (Timer4CntSawtoothWave == (x))          ||                                 \
    (Timer4CntTriangularWave == (x)))

/*!< Parameter validity check for CNT interrupt mask  */
#define IS_VALID_CNT_INT_MSK(x)                                                \
(   (Timer4CntIntMask0  == (x))             ||                                 \
    (Timer4CntIntMask1  == (x))             ||                                 \
    (Timer4CntIntMask2  == (x))             ||                                 \
    (Timer4CntIntMask3  == (x))             ||                                 \
    (Timer4CntIntMask4  == (x))             ||                                 \
    (Timer4CntIntMask5  == (x))             ||                                 \
    (Timer4CntIntMask6  == (x))             ||                                 \
    (Timer4CntIntMask7  == (x))             ||                                 \
    (Timer4CntIntMask8  == (x))             ||                                 \
    (Timer4CntIntMask9  == (x))             ||                                 \
    (Timer4CntIntMask10 == (x))             ||                                 \
    (Timer4CntIntMask11 == (x))             ||                                 \
    (Timer4CntIntMask12 == (x))             ||                                 \
    (Timer4CntIntMask13 == (x))             ||                                 \
    (Timer4CntIntMask14 == (x))             ||                                 \
    (Timer4CntIntMask15 == (x)))

/*!< Parameter validity check for CNT match interrupt type  */
#define IS_VALID_CNT_INT_TYPE(x)                                               \
(   (Timer4CntZeroMatchInt == (x))          ||                                 \
    (Timer4CntPeakMatchInt == (x)))

/*!< Parameter validity check for CNT clock source  */
#define IS_VALID_CNT_CLK(x)                                                    \
(   (Timer4CntPclk == (x))                  ||                                 \
    (Timer4CntExtclk == (x)))

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief Initialize Timer4 CNT
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] pstcInitCfg             Pointer to CNT initialization configuration structure
 ** \arg This parameter detail refer @ref stc_timer4_cnt_init_t
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TMR4x is invalid
 **                                     - pstcInitCfg == NULL
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_Init(M4_TMR4_TypeDef *TMR4x,
                                const stc_timer4_cnt_init_t *pstcInitCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    stc_tmr4_ccsr_field_t CCSR_f = {0};
    stc_tmr4_cvpr_field_t CVPR_f = {0};

    /* Check for TMR4x && pstcInitCfg pointer */
    if ((IS_VALID_TIMER4(TMR4x)) && (NULL != pstcInitCfg))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CNT_CLK(pstcInitCfg->enClk));
        DDL_ASSERT(IS_VALID_CNT_MODE(pstcInitCfg->enCntMode));
        DDL_ASSERT(IS_VALID_CNT_CLK_DIV(pstcInitCfg->enClkDiv));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enBufferCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enZeroIntCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enPeakIntCmd));
        DDL_ASSERT(IS_VALID_CNT_INT_MSK(pstcInitCfg->enZeroIntMsk));
        DDL_ASSERT(IS_VALID_CNT_INT_MSK(pstcInitCfg->enPeakIntMsk));

        /* Set default value */
        TMR4x->CCSR = (uint16_t)0x0050u;
        TMR4x->CNTR = (uint16_t)0x0000u;
        TMR4x->CPSR = (uint16_t)0xFFFFu;
        TMR4x->CVPR = (uint16_t)0x0000u;

        /* stop count of CNT */
        CCSR_f.STOP = 1u;

        /* set count clock div of CNT */
        CCSR_f.CKDIV = pstcInitCfg->enClkDiv;

        /* set cnt mode */
        CCSR_f.MODE = pstcInitCfg->enCntMode;

        /* set buffer enable bit */
        CCSR_f.BUFEN = (uint16_t)(pstcInitCfg->enBufferCmd);

        /* set external clock enable bit */
        CCSR_f.ECKEN = (Timer4CntExtclk == pstcInitCfg->enClk) ? ((uint16_t)1u) : ((uint16_t)0u);

        /* Set interrupt enable */
        CCSR_f.IRQZEN = (uint16_t)(pstcInitCfg->enZeroIntCmd);
        CCSR_f.IRQPEN = (uint16_t)(pstcInitCfg->enPeakIntCmd);

        /* set intterrupt mask times */
        CVPR_f.ZIM = (uint16_t)(pstcInitCfg->enZeroIntMsk);
        CVPR_f.PIM = (uint16_t)(pstcInitCfg->enPeakIntMsk);

        /* Set Timer4 register */
        TMR4x->CVPR_f = CVPR_f;
        TMR4x->CCSR_f = CCSR_f;
        TMR4x->CPSR = pstcInitCfg->u16Cycle;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief De-initialize Timer4 CNT
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 **
 ** \retval Ok                          De-Initialize successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_DeInit(M4_TMR4_TypeDef *TMR4x)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Set default value */
        TMR4x->CCSR = (uint16_t)0x0050u;
        TMR4x->CNTR = (uint16_t)0x0000u;
        TMR4x->CPSR = (uint16_t)0xFFFFu;
        TMR4x->CVPR = (uint16_t)0x0000u;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set Timer4 CNT clock source
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCntClk                Timer4 CNT clock source
 ** \arg Timer4CntPclk                  Uses the internal clock (PCLK) as CNT's count clock.
 ** \arg Timer4CntExtclk                Uses an external input clock (EXCK) as CNT's count clock.
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_SetClock(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_cnt_clk_t enCntClk)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CNT_CLK(enCntClk));
        /* set external clock enable bit */
        TMR4x->CCSR_f.ECKEN = (uint16_t)(enCntClk);
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get Timer4 CNT clock source
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 **
 ** \retval Timer4CntPclk               Uses the internal clock (PCLK) as CNT's count clock.
 ** \retval Timer4CntExtclk             Uses an external input clock (EXCK) as CNT's count clock.
 **
 ******************************************************************************/
en_timer4_cnt_clk_t TIMER4_CNT_GetClock(M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));

    return (en_timer4_cnt_clk_t)(TMR4x->CCSR_f.ECKEN);
}

/**
 *******************************************************************************
 ** \brief  Set Timer4 CNT clock division
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enClkDiv                Timer4 CNT clock division
 ** \arg Timer4CntPclkDiv1              Timer4 CNT clock: PCLK
 ** \arg Timer4CntPclkDiv2              Timer4 CNT clock: PCLK/2
 ** \arg Timer4CntPclkDiv4              Timer4 CNT clock: PCLK/4
 ** \arg Timer4CntPclkDiv8              Timer4 CNT clock: PCLK/8
 ** \arg Timer4CntPclkDiv16             Timer4 CNT clock: PCLK/16
 ** \arg Timer4CntPclkDiv32             Timer4 CNT clock: PCLK/32
 ** \arg Timer4CntPclkDiv64             Timer4 CNT clock: PCLK/64
 ** \arg Timer4CntPclkDiv128            Timer4 CNT clock: PCLK/128
 ** \arg Timer4CntPclkDiv256            Timer4 CNT clock: PCLK/256
 ** \arg Timer4CntPclkDiv512            Timer4 CNT clock: PCLK/512
 ** \arg Timer4CntPclkDiv1024           Timer4 CNT clock: PCLK/1024
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_SetClockDiv(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_cnt_clk_div_t enClkDiv)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CNT_CLK_DIV(enClkDiv));
        TMR4x->CCSR_f.CKDIV = (uint16_t)enClkDiv;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Get Timer4 CNT clock division
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 **
 ** \retval Timer4CntPclkDiv1           Timer4 CNT clock: PCLK
 ** \retval Timer4CntPclkDiv2           Timer4 CNT clock: PCLK/2
 ** \retval Timer4CntPclkDiv4           Timer4 CNT clock: PCLK/4
 ** \retval Timer4CntPclkDiv8           Timer4 CNT clock: PCLK/8
 ** \retval Timer4CntPclkDiv16          Timer4 CNT clock: PCLK/16
 ** \retval Timer4CntPclkDiv32          Timer4 CNT clock: PCLK/32
 ** \retval Timer4CntPclkDiv64          Timer4 CNT clock: PCLK/64
 ** \retval Timer4CntPclkDiv128         Timer4 CNT clock: PCLK/128
 ** \retval Timer4CntPclkDiv256         Timer4 CNT clock: PCLK/256
 ** \retval Timer4CntPclkDiv512         Timer4 CNT clock: PCLK/512
 ** \retval Timer4CntPclkDiv1024        Timer4 CNT clock: PCLK/1024
 **
 ******************************************************************************/
en_timer4_cnt_clk_div_t TIMER4_CNT_GetClockDiv(M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));

