RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer4_cnt.c
    return (en_timer4_cnt_clk_div_t)(TMR4x->CCSR_f.CKDIV);
}

/**
 *******************************************************************************
 ** \brief Set Timer4 CNT mode
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enMode                  Timer4 CNT mode
 ** \arg Timer4CntSawtoothWave          Timer4 count mode:sawtooth wave
 ** \arg Timer4CntTriangularWave        Timer4 count mode:triangular wave
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_SetMode(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_cnt_mode_t enMode)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CNT_MODE(enMode));
        TMR4x->CCSR_f.MODE = (uint16_t)enMode;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get Timer4 CNT mode
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 **
 ** \retval Timer4CntSawtoothWave       Timer4 count mode:sawtooth wave
 ** \retval Timer4CntTriangularWave     Timer4 count mode:triangular wave
 **
 ******************************************************************************/
en_timer4_cnt_mode_t TIMER4_CNT_GetMode(M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));

    return (en_timer4_cnt_mode_t)(TMR4x->CCSR_f.MODE);
}

/**
 *******************************************************************************
 ** \brief Start Timer4 CNT
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 **
 ** \retval Ok                          Start successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_Start(M4_TMR4_TypeDef *TMR4x)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        TMR4x->CCSR_f.STOP = (uint16_t)0u;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Stop Timer4 CNT
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 **
 ** \retval Ok                          Stop successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_Stop(M4_TMR4_TypeDef *TMR4x)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        TMR4x->CCSR_f.STOP = (uint16_t)1u;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set Timer4 CNT interrupt
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enIntType               The specified type of Timer4 CNT interrupt
 ** \arg Timer4CntZeroMatchIrq          Zero match interrupt of Timer4 CNT
 ** \arg Timer4CntPeakMatchIrq          Peak match interrupt of Timer4 CNT
 ** \param [in] enCmd                   DCU interrupt functional state
 ** \arg Enable                         Enable the specified Timer4 CNT interrupt function
 ** \arg Disable                        Disable the specified Timer4 CNT interrupt function
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TMR4x is invalid
 **                                     - enIntType is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_IrqCmd(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_cnt_int_t enIntType,
                                en_functional_state_t enCmd)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enCmd));
        DDL_ASSERT(IS_VALID_CNT_INT_TYPE(enIntType));

        enRet = Ok;
        switch (enIntType)
        {
            case Timer4CntZeroMatchInt:
                TMR4x->CCSR_f.IRQZEN = (uint16_t)enCmd;
                break;
            case Timer4CntPeakMatchInt:
                TMR4x->CCSR_f.IRQPEN = (uint16_t)enCmd;
                break;
            default:
                enRet = ErrorInvalidParameter;
                break;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Get Timer4 CNT interrupt flag
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enIntType               Timer4 CNT interrupt type
 ** \arg Timer4CntZeroMatchIrq          Zero match interrupt of Timer4 CNT
 ** \arg Timer4CntPeakMatchIrq          Peak match interrupt of Timer4 CNT
 **
 ** \retval Reset                       None interrupt request on Timer4 CNT
 ** \retval Set                         Detection interrupt request on Timer4 CNT
 **
 ******************************************************************************/
en_flag_status_t TIMER4_CNT_GetIrqFlag(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_cnt_int_t enIntType)
{
    uint16_t u16Flag = 0u;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));
    DDL_ASSERT(IS_VALID_CNT_INT_TYPE(enIntType));

    switch (enIntType)
    {
        case Timer4CntZeroMatchInt:
            u16Flag = TMR4x->CCSR_f.IRQZF;
            break;
        case Timer4CntPeakMatchInt:
            u16Flag = TMR4x->CCSR_f.IRQPF;
            break;
        default:
            break;
    }

    return (en_flag_status_t)u16Flag;
}

/**
 *******************************************************************************
 ** \brief  Clear Timer4 CNT interrupt flag
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enIntType               Timer4 CNT interrupt type
 ** \arg Timer4CntZeroMatchIrq          Zero match interrupt of Timer4 CNT
 ** \arg Timer4CntPeakMatchIrq          Peak match interrupt of Timer4 CNT
 **
 ** \retval Ok                          Clear successfully.
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TMR4x is invalid
 **                                     - enIntType is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_CNT_ClearIrqFlag(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_cnt_int_t enIntType)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CNT_INT_TYPE(enIntType));

